# 5- Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# *Пример:*

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

from math import sqrt


print("Точка А")
a = [0] * 2
a[0] = int(input("x = "))
a[1] = int(input("y = "))

print("Точка В")
b = [0] * 2
b[0] = int(input("x = "))
b[1] = int(input("y = "))

distance = sqrt((a[0] - b[0])**2 + (a[1] - b[1]) **2)

print(f"Расстояние между А и В: {round(distance, 3)}")