#2 - Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

#*Пример:*

#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]

import math

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9]
len_list = math.ceil(len(my_list)/2)
new_list = []

for i in range(len_list):
    new_list.append(my_list[i] * my_list[-i-1])

print(f"Произведение пар: \r\n {new_list}")
